// by firefox 09/30/2010
/*  
节日服务 

参考文献：
  中国传统节日：http://baike.baidu.com/view/182671.htm
  玄奘故里：http://www.hudong.com/wiki/%E7%8E%84%E5%A5%98%E6%95%85%E9%87%8C

*/

#include <xyj_x.h>
#include <localtime.h>

/********************************数据定义***********************************/

//指定日期启动的对象，每日零点检查特殊日期
mixed* _date = ({

	({ __FILE__,	({ 3, 12 }), 0 }),	//开站

	//公历节日
	({ __FILE__,	({ 1, 1 }),	0 }),	//元旦
	({ __FILE__,	({ 2, 14 }), 0 }),	//情人
	({ __FILE__,	({ 4, 1 }), 0 }),	//愚人
	({ __FILE__,	({ 5, 1 }),	0 }),	//五一
	({ __FILE__,	({ 10, 1 }), 0 }),	//国庆
	({ __FILE__,	({ 12, 25 }), 0 }),	//圣诞

	//农历节日，及西游人物的诞辰
	({ __FILE__,	({ 1, 1 }),	1 }),	//春节
	({ __FILE__,	({ 1, 2 }),	1 }),	//春节
	({ __FILE__,	({ 1, 3 }),	1 }),	//春节
	({ __FILE__,	({ 1, 4 }),	1 }),	//春节
	({ __FILE__,	({ 1, 5 }),	1 }),	//春节
	({ __FILE__,	({ 1, 15 }), 1 }),	//元宵
	({ __FILE__,	({ 3, 3 }), 1 }),	//上巳，王母娘娘开蟠桃会 
	({ __FILE__,	({ 3, 9 }), 1 }),	//西游记第一传奇废物诞生了
	({ __FILE__,	({ 4, 8 }), 1 }),	//佛诞
	({ __FILE__,	({ 5, 5 }),	1 }),	//端午
	({ __FILE__,	({ 7, 7 }), 1 }),	//七夕
	({ __FILE__,	({ 7, 15 }), 1 }),	//中元节，又称鬼节
	({ __FILE__,	({ 7, 30 }), 1 }),	//地藏
	({ __FILE__,	({ 8, 15 }), 1 }),	//中秋
	({ __FILE__,	({ 9, 9 }), 1 }),	//重阳
	({ __FILE__,	({ 12, 8 }), 1 }),	//腊八

	//不确定日期的节日
	({ __FILE__,	({ 5, 9 }),	0 }),	//母亲 5月的第二个星期天
	({ __FILE__,	({ 6, 20 }), 0 }),	//父亲 6月的第三个星期日

	({ __FILE__,	({ 4, 5 }), 0 }),	//清明 4月4-6日

});


/********************************函数定义***********************************/

void create()
{
	seteuid(getuid());
	//set_heart_beat(60);
}

//匹配日期(月份0表示1月)
private match(int* d1, mixed d2)
{
	return d1[1] == d2[LT_MDAY] && (d1[0] - 1) == d2[LT_MON];
}

//触发定时器
void heart_beat()
{
}

//每日零点，检查节日
void start()
{
	mixed* date = ({
		localtime(time()),			//公历
		LCALENDAR->luanr_date(),		//农历
	});
	trace("holiday start!", D_WIZ);

	foreach(mixed* arr in _date) {
		if(match(arr[1], date[arr[2]])) {
			object ob = load_object(arr[0]);
			if(ob) ob->start();
		}
	}
}
