二尺四寸高。怎么用得三十六个人抬？那瓶乃阴阳二气之宝，内有七宝八卦、二十四气，要三十六人，按天罡之数，才抬得动。
	不一时，将宝瓶抬出，放在三层门外，展得干净，揭开盖，把行者解了绳索，剥了衣服，
	
	就着那瓶中仙气，飕的一声，吸入里面，
	
	将盖子盖上，贴了封皮，却去吃酒道：“猴儿今番入我宝瓶之中，再莫想那西方之路！若还能彀拜佛求经，除是转背摇车，再去投胎夺舍是。”你看那大小群妖，一个个笑呵呵都去贺功不题。斋
    却说大圣到了瓶中，被那宝贝将身束得小了，索性变化，蹲在当中。半晌，倒还荫凉，忽失声笑道：“这妖精外有虚名，内无实事。怎么告诵人说这瓶装了人，一时三刻，化为脓血？若似这般凉快，就住上七八年也无事！”咦！大圣原来不知那宝贝根由：假若装了人，一年不语，一年荫凉，但闻得人言，就有火来烧了。大圣未曾说完，只见满瓶都是火焰。幸得他有本事，坐在中间，捻着避火诀，全然不惧。耐到半个时辰，四周围钻出四十条蛇来咬。行者轮开手，抓将过来，尽力气一揝，揝做八十段。少时间，又有三条火龙出来，把行者上下盘绕，着实难禁，自觉慌张无措道：“别事好处，这三条火龙难为。再过一会不出，弄得火气攻心，怎了？”他想道：“我把身子长一长，券破罢。”主
    好大圣，捻着诀，念声咒，叫：“长！”即长了丈数高下，那瓶紧靠着身，也就长起去，他把身子往下一小，那瓶儿也就小下来了。行者心惊道：“难，难，难！怎么我长他也长，我小他也小？如之奈何！”说不了，孤拐上有些疼痛，急伸手摸摸，却被火烧软了，自己心焦道：“怎么好？孤拐烧软了！弄做个残疾之人了！”忍不住吊下泪来，这正是：遭魔遇苦怀三藏，着难临危虑圣僧。道：“师父啊！当年皈正，蒙观音菩萨劝善，脱离天灾，我与你苦历诸山，收殄多怪，降八戒，得沙僧，千辛万苦，指望同证西方，共成正果。何期今日遭此毒魔，老孙误入于此，倾了性命，撇你在半山之中，不能前进！想是我昔日名高，故有今朝之难！”正此凄怆，忽想起菩萨当年在蛇盘山曾赐我三根救命毫毛，不知有无，且等我寻一寻看。即伸手浑身摸了一把，只见脑后有三根毫毛，十分挺硬，忽喜道：“身上毛都如彼软熟，只此三根如此硬枪，必然是救我命的。”即便咬着牙，忍着疼，拔下毛，吹口仙气，叫：“变！”一根即变作金钢钻，一根变作竹片，一根变作绵绳。扳张篾片弓儿，牵着那钻，照瓶底下飕飕的一顿钻，钻成一个眼孔，透进光亮，喜道：“造化，造化！却好出去也！”才变化出身，那瓶复荫凉了。怎么就凉？原来被他钻了，把阴阳之气泄了，故此遂凉。斋