/*

白花蛇，	一条青白相间的花蛇。
愁雾蟒，	一条千尺巨蟒。

怪风蛇，	一条百丈长蛇。


//绝技，吐雾，

身上的青光再闪，那蛇喷出一股绿雾，显得舒畅无比，然后它巨大的蛇尾一甩，一头扎进了湖中。湖面立时如同投入了一个巨大的炸弹般，变得波涛翻涌，足足过了十几分钟，湖面才渐渐平静下来，又变得如同一面镜子般平整。

洞口冒出一大团白雾，一个三角形的吐着信子的绿色蛇首从雾中伸出来，大半的身躯笼罩在雾中，只露出后面拖着的长长尾巴。

蛇头扭动，从左自右看了遍峡谷上空，接着又凝望月亮的方向，丝丝薄雾不停从它嘴里吐出来。天空的风雷之鹰都好像知道这条玄蛇的厉害，远远绕着飞过。就连那只金眼鹰王也只是在附近盘旋，却不靠近。

天色愈发昏暗，随着蛇王的吐息，白雾渐渐增多，把整个蛇首都覆盖，只有一小截蛇尾露在地面。突然烟雾像被利剑破开，蛇首从雾中伸出，闪电般咬向空中飞过的一只风雷之鹰。


眼射晓星，鼻喷朝雾。
密密牙排钢剑，弯弯爪曲金钩。
头戴一条肉角，好便似千千块玛瑙攒成；
身披一派红鳞，却就如万万片胭脂砌就。
盘地只疑为锦被，飞空错认作虹霓。
歇卧处有腥气冲天，行动时有赤云罩体。
大不大，两边人不见东西；
长不长，一座山跨占南北。

*/