

/*

黄毛貂鼠
黄鼠狼

/d/dntg/hgs/guchang		muji

$N醒了，从草丛中钻出来，$n警惕的看着$N。


那怪害怕，也使一般本事：急回头，望着巽地上把口张了三张，嘑的一口气，吹将出去，忽然间，一阵黄风，从空刮起。好风！真个利害：

冷冷飕飕天地变，无影无形黄沙旋。
穿林折岭倒松梅，播土扬尘崩岭坫。
黄河浪泼彻底浑，湘江水涌翻波转。
碧天振动斗牛宫，争些刮倒森罗殿。
五百罗汉闹喧天，八大金刚齐嚷乱。
文殊走了青毛狮，普贤白象难寻见。
真武龟蛇失了群，梓橦骡子飘其韂。
行商喊叫告苍天，梢公拜许诸般愿。
烟波性命浪中流，名利残生随水办。
仙山洞府黑攸攸，海岛蓬莱昏暗暗。
老君难顾炼丹炉，寿星收了龙须扇。
王母正去赴蟠桃，一风吹断裙腰钏。
二郎迷失灌州城，哪吒难取匣中剑。
天王不见手心塔，鲁班吊了金头钻。
雷音宝阙倒三层，赵州石桥崩两断。
一轮红日荡无光，满天星斗皆昏乱。
南山鸟往北山飞，东湖水向西湖漫。
雌雄拆对不相呼，子母分离难叫唤。
龙王遍海找夜叉，雷公到处寻闪电。
十代阎王觅判官，地府牛头追马面。
这风吹倒普陀山，卷起观音经一卷。
白莲花卸海边飞，欢倒菩萨十二院。
盘古至今曾见风，不似这风来不善。
唿喇喇，
乾坤险不炸崩开，万里江山都是颤！

那妖怪使出这阵狂风，就把孙大圣毫毛变的小行者刮得在那半空中，却似纺车儿一般乱转，莫想轮得棒，如何拢得身？慌得行者将毫毛一抖，收上身来，独自个举着铁棒，上前来打，又被那怪劈脸喷了一口黄风，把两只火眼金睛，刮得紧紧闭合，莫能睁开，因此难使铁棒，遂败下阵来。那妖收风回洞不题。

行者道：『我被那怪一口风喷将来，吹得我眼珠酸痛，这会子冷泪常流。』

老者道：『那风，能吹天地暗，善刮鬼神愁，裂石崩崖恶，吹人命即休。你们若遇着他那风吹了呵，还想得活哩！只除是神仙，方可得无事。』

那老者道：『既如此说，也是个有来头的人。我这敝处却无卖眼药的，老汉也有些迎风冷泪，曾遇异人传了一方，名唤三花九子膏，能治一切风眼。』 




$N口张了三张一口气吹出，忽然间一阵黄风从空刮起。

冷冷飕飕天地变，无影无形黄沙旋。

$n被吹的眼睛肿得像桃一样。

$n眼珠酸痛，冷泪常流，眼前一片模糊。

吹飞小妖怪。

*/