
#include <xyj_x.h>
#include <ansi.h>

inherit __DIR__"mapper";

#define BG_WIDTH		17
#define BG_HEIGHT		17

mapping _fort = ([
	([
		"short"		: "山脚下",
		"long"		: "
前面一座高山，峰插碧空，真个是摩星碍日。暴雨刚过，新凉
透体，那真是：
" + "\n"HIG + "
    急雨收残暑，梧桐一叶惊。
    萤飞莎径晚，蛩语月华明。
" + "\n"NOR,

	])		: ({1, 1}),

	([
		"short"		: "马厩",
		"long"		: "
厩中养着千匹战马，每匹都是日行千里，渡水登山，
如履平地之神驹。一个个，嘶风逐电，攒蹄不息。
",
	])		: ({4, 4}),

	([
		"short"		: "西方洞",
		"long"		: "
石洞里又是一番天地，但见冷气森森刺骨寒，一层层蜘蛛网叠
将着坠下来，密密麻麻铺天盖地。你不禁打了一个寒战，倒吸
一口寒气。
",
	])		: ({12, 4}),

	([
		"short"		: "铁匠铺",
		"long"		: "
铁匠铺里颇为宽大，靠墙有一排大火炉，呼呼地喷着通红的火
焰。屋子后面更是一个大铁熔炉，用以制造专门的特大号铁器
和兵器。
",
	])		: ({8, 8}),

	([
		"short"		: "小木屋",
		"long"		: "
走进这间小木屋，你又吃了一惊。这里居然暖烘烘的，跟外面
的冰天雪地仿佛是两个世界。屋内靠墙摆着一圈大大小小的花
盆，里面种着各式各样叫不上名子的花草。
",
	])		: ({4, 12}),

	([
		"short"		: "稻田",
		"long"		: "
稻田里村民们正在耕种着。一片一片的农田连结成网，小沟小
渠密布其中。
",
	])		: ({12, 12}),

	([
		"short"		: "狮驼洞",
		"long"		: "
洞内清奇幽雅，秀丽宽平；左右有瑶草仙花，前后有乔松翠竹
粗看之下，宛如神仙居所。往深处望去，谁料：
" + "\n    "HIR"骷髅若岭，骸骨如林\n\n"NOR,

	])		: ({15, 15}),
]);


mapping _bridge = ([
	([
		"short"		: "石桥",
		"long"		: "
山溪上一座石桥悠悠架起，两边古树森齐，桥下潺潺流水通长
溪，桥东面是一望无际的乔木树林，桥西北面是茅草屋，清清
雅雅若仙庵。
",
	])		: ({3, 5}),

	([
		"short"		: "凌云渡",
		"long"		: "
雾气中，一道山涧冲下来，滚浪飞流。山涧下是万丈飞虹，水
面宽阔翻滚着千条白练。渡口岸见不到其它的路可走，上面架
着一根独木桥。
",
	])		: ({8, 6}),

	([
		"short"		: "小桥流水",
		"long"		: "
一座古色古香的小石桥，桥墩上刻着“太极”两个篆体字。
桥下小河流水叮咚，河水晶莹透澈，桥上坐着位蓑衣渔翁，
仙风道骨，正吟诗作歌。一片宁静安详的气氛，你几乎忘了
尘世间的烦恼。
",
	])		: ({8, 10}),

	([
		"short"		: "云头桥",
		"long"		: "
一条河东西方向横在面前，两岸泥泞，沼泽连片。走进去怕是会
陷在里面人马无归，河心更是急流滚滚。
",
	])		: ({13, 11}),
]);

mapping _road = ([
	([
		"short"		: "荒野",
		"long"		: "
荒野四处辽阔，远方可见群山峻岭峭壁，近处有小路进出大小
森林树木。风吹过洒洒之声不断，流水潺潺，时闻苍狼嗥叫，
时闻饿虎咆哮。
",
	])		: ([
		({1, 1})	: "2se;3s;se",
		({4, 3})	: "s;w;n;2e;se;e",
	]),
	([
		"short"		: "岭道",
		"long"		: "
高山峻岭曲折盘绕，林原莽莽荒道坎坷。你走在一条荒芜的岭
道上，时而有峭壁直立时而又有涧水长流。正是野润烟光淡，
石翡山色翠。
",
	])		: ([
		({15, 15})	: "2nw;3n;nw",
		({12, 13})	: "n;e;s;2w;nw;w",
	]),

	([
		"short"		: "潭边小路",
		"long"		: "
小路因为年久无人走动的关系，已被枯黄的树叶覆盖了。路边的
荒草几有人高，阵风吹过，卷起一片片的枯叶。草从中也呼呼做
响，象是猛兽发出的吼声。
",
	])		: ([
		({4, 7})	: "2s;3se;ne;se",
	]),
	([
		"short"		: "羊肠小道",
		"long"		: "
一条蜿蜒曲折的小径，两边都是刀削般的峭壁。
路旁长满了一人多高的野草，据说常有妖怪精灵
出没。
",
	])		: ([
		({12, 9})	: "2n;3nw;sw;nw",
	]),

	([
		"short"		: HIW"茫茫雪峰"NOR,
		"long"		: "
北风呼啸，飞雪茫茫，四面望去均是绵延不尽的雪峰。天地之间
似已毫无生迹，除了雪还是雪。
",
	])		: ([
		({4, 9})	: "sw;s;2se;e;ne",
	]),
	([
		"short"		: "山路",
		"long"		: "
好不容易走出了小林，迈上了一条山间小路。越走树林越密，树缝
中洒下来的阳光也变得斑斑点点。茅草渐厚，灌木丛生。从东北方
吹来阵阵的冷风，令人毛骨耸然。
",
	])		: ([
		({12, 7})	: "ne;n;2nw;w;sw",
	]),

	([
		"short"		: "背阴小道",
		"long"		: "
这里是一条陡峭的小路，向上是背阴山，南边一座小桥，就是
令人胆颤的奈何桥。能听到桥下滚滚水声，也能听到鬼狼凄叫。
几个桥梁使者手握皮鞭，正驱敢着一些鬼怪。
",
	])		: ([
		({8, 5})	: "2s;sw;2e;sw;2s",
		({8, 7})	: "se;sw;nw",
	]),
]);

mapping _river = ([
	([
		"short"		: "白石溪",
		"long"		: "
潺潺流水向山下流去，溪水清彻见底。水底布满了大小不一，洁
白如玉的鹅卵石，溪中的小鱼游来游去。溪边的草从中不时传出
蛙鸣。
",
	])		: ([
		({0, 2})	: "se;s;se;e",
	]),
	([
		"short"		: "碧溪",
		"long"		: "
只见香兰沿溪而生，芳草连天。溪水清绿流音潺潺。环绕着石
屋。也听见野禽声聒聒，也看见幽鹿步徐徐。真正是个仙家去
绝妙处，凡世哪里寻得到。
",
	])		:  ([
		({16, 14})	: "nw;n;nw;w",
	]),


	([
		"short"		: "灌江",
		"long"		: "
灌江水面不宽，江水缓缓向东流去。江面上偶尔出现几只打渔
的小船。一条土路顺江而铺，向东直通到灌江入长江的灌江口。
路上偶有几个行人，都是神色匆匆，忙着赶路。
",
	])		: ([
		({3, 5})	: "e;se;3e",
	]),

	([
		"short"		: "通天河",
		"long"		: "
洋洋光浸月，浩浩影浮天。灵派吞华岳，长流贯百川。千层汹
浪滚，万迭峻波颠。岸口无渔火，沙头有鹭眠。茫然浑似海，
一望更无边。
",
	])		:  ([
		({13, 11})	: "w;nw;3w",
	]),

	([
		"short"		: "子母河",
		"long"		: "
一道小河，澄澄清水，湛湛寒波。远见河那边有柳阴垂碧，野
润烟光淡，沙暄日色曛。几处园林花放蕊，阳回大地柳芽新。
",
	])		:  ([
		({8, 6})	: "e;se;3s",
	]),

	([
		"short"		: "流沙河",
		"long"		: "
八百流沙界，三千弱水深。鹅毛飘不起，芦花定底沉。浪涌如
山，波翻若岭。
",
	])		:  ([
		({8, 10})	: "w;nw;3n",
	]),

]);

//获取据点坐标
mixed* forts()
{
	return values(_fort);
}

//将建对象，放入地图
private object new_ob(object room, string file)
{
	object ob = new_elem(file);
	assert(ob && room);
	ob->move(room);
	trace(ob->name() + ":" + environment(ob)->query("short"));
	return ob;
}

object* _flags = ({});

//获取旗子
object* flags()
{
	if(!sizeof(_flags)) {
		foreach(int* xy in forts()) {
			object flag = new_ob(at(xy[0], xy[1]), __DIR__"flag");
			_flags += ({ flag });			
		}
	}
	return _flags;
}

object* _leaders = ({0, 0, 0});

//获取统帅
object* leaders()
{
	return _leaders;
}

//画出地图
void draw_all()
{
	//画出地图
	int n = draw(([
		"fort"		: _fort,
		"river"		: _river,
		"bridge"	: _bridge,
		"road"		: _road
	]));

	printf("create room: %d\n", n);
	
	//增加跳崖点
	set_move(at(4, 12), at(5, 10), "jump");
	set_move(at(11, 6), at(12, 4), "jump");
	
	//增加跳水/上岸点
	water_land(({0, 2}), ({1, 1}));
	water_land(({16, 14}), ({15, 15}));
	water_land(({4, 5}), ({4, 4}));
	water_land(({12, 11}), ({12, 12}));
	water_land(({10, 7}), ({9, 8}), ({11, 6}));
	water_land(({6, 9}), ({5, 10}), ({7, 8}));

	//设置入口
	set("entrance", ({0, at(1, 1), at(15, 15)}));
	flags();

	//统帅
	_leaders[1] = new_ob(at(1, 1), __DIR__"npc-xian");
	_leaders[2] = new_ob(at(15, 15), __DIR__"npc-mo");
}


void create()
{
	set("name", "绘图仪");
	set("short", "绘图仪");

	seteuid(getuid());
	draw_all();

	for(int i = 0; i < 10; ++i)
		new_to(__DIR__"npc-rnd", random_room1());
}


void show(object who)
{
	 show_map(who, BG_WIDTH, BG_HEIGHT);
}

void test()
{
	object who = this_player();
	draw_all();
	to(1, 1);
}

void test_show()
{
	object who = this_player();
	show(who);
}

