
#include "alx.h"

inherit BG_MAPPER;

#define BG_WIDTH		33
#define BG_HEIGHT		33

mapping fort = ([
	([
		"short"		: "仙石",
		"long"		: @LONG
这里是花果山腰的一块平地。一道瀑布从山顶飞流直下，
泻入一眼深潭，当真是：“一派白虹起，千寻雪浪飞”。
瀑布边上有一块大石头，相传为天地灵气所化。不知是谁在
上面刻了一首诗：
LONG + "\n"HIG + @LONG
    混沌未分天地乱，茫茫渺渺无人见。
    自从盘古破鸿蒙，开辟从兹清浊辨。
LONG + "\n"NOR,

	])		: ({2, 2}),

	([
		"short"		: "马厩",
		"long"		: @LONG
厩中养着千匹战马，每匹都是日行千里，渡水登山，
如履平地之神驹。一个个，嘶风逐电，攒蹄不息。
LONG,
	])		: ({8, 8}),

	([
		"short"		: "盘丝洞",
		"long"		: @LONG
石洞里又是一番天地，但见冷气森森刺骨寒，一层层蜘蛛网叠
将着坠下来，密密麻麻铺天盖地。你不禁打了一个寒战，倒吸
一口寒气。
LONG,
	])		: ({24, 8}),

	([
		"short"		: "铁匠铺",
		"long"		: @LONG
铁匠铺里颇为宽大，靠墙有一排大火炉，呼呼地喷着通红的火
焰。屋子后面更是一个大铁熔炉，用以制造专门的特大号铁器
和兵器。
LONG,
	])		: ({16, 16}),

	([
		"short"		: "小木屋",
		"long"		: @LONG
走进这间小木屋，你又吃了一惊。这里居然暖烘烘的，跟外面
的冰天雪地仿佛是两个世界。屋内靠墙摆着一圈大大小小的花
盆，里面种着各式各样叫不上名子的花草。
LONG,
	])		: ({8, 24}),

	([
		"short"		: "稻田",
		"long"		: @LONG
稻田里村民们正在耕种着。一片一片的农田连结成网，小沟小
渠密布其中。
LONG,
	])		: ({24, 24}),

	([
		"short"		: "天魔台",
		"long"		: @LONG
这是一张用万年南极冰玉所雕成的玉台，玲珑透剔。台上刻着几
个殷红的大字：
LONG + "\n    "HIR"入我门来，万劫不复\n\n"NOR,

	])		: ({30, 30}),
]);


mapping bridge = ([
	([
		"short"		: "石桥",
		"long"		: @LONG
山溪上一座石桥悠悠架起，两边古树森齐，桥下潺潺流水通长
溪，桥东面是一望无际的乔木树林，桥西北面是茅草屋，清清
雅雅若仙庵。
LONG,
	])		: ({6, 11}),

	([
		"short"		: "凌云渡",
		"long"		: @LONG
雾气中，一道山涧冲下来，滚浪飞流。山涧下是万丈飞虹，水
面宽阔翻滚着千条白练。渡口岸见不到其它的路可走，上面架
着一根独木桥。
LONG,
	])		: ({16, 11}),

	([
		"short"		: "小桥流水",
		"long"		: @LONG
一座古色古香的小石桥，桥墩上刻着“太极”两个篆体字。
桥下小河流水叮咚，河水晶莹透澈，桥上坐着位蓑衣渔翁，
仙风道骨，正吟诗作歌。一片宁静安详的气氛，你几乎忘了
尘世间的烦恼。
LONG,
	])		: ({16, 21}),

	([
		"short"		: "云头桥",
		"long"		: @LONG
一条河东西方向横在面前，两岸泥泞，沼泽连片。走进去怕是会
陷在里面人马无归，河心更是急流滚滚。
LONG,
	])		: ({25, 21}),
]);

mapping road = ([
	([
		"short"		: "荒野",
		"long"		: @LONG
荒野四处辽阔，远方可见群山峻岭峭壁，近处有小路进出大小
森林树木。风吹过洒洒之声不断，流水潺潺，时闻苍狼嗥叫，
时闻饿虎咆哮。
LONG,
	])		: ([
		({2, 2})	: "4se;3e;2se;s;sw;2nw;n;n",
		({8, 8})	: "sw;w;nw;n;ne",
		({6, 9})	: "4s;se;2s",
	]),

	([
		"short"		: "潭边小路",
		"long"		: @LONG
小路因为年久无人走动的关系，已被枯黄的树叶覆盖了。路边的
荒草几有人高，阵风吹过，卷起一片片的枯叶。草从中也呼呼做
响，象是猛兽发出的吼声。
LONG,
	])		: ([
		({7, 16})	: "6se;e;se;e;2n",
	]),

	([
		"short"		: HIW"茫茫雪峰"NOR,
		"long"		: @LONG
北风呼啸，飞雪茫茫，四面望去均是绵延不尽的雪峰。天地之间
似已毫无生迹，除了雪还是雪。
LONG,
	])		: ([
		({7, 16})	: "sw;2s;5se;s;se;e;3ne",
		({8, 24})	: "3n",
		({8, 24})	: "se;2e",
	]),

	([
		"short"		: "岭道",
		"long"		: @LONG
高山峻岭曲折盘绕，林原莽莽荒道坎坷。你走在一条荒芜的岭
道上，时而有峭壁直立时而又有涧水长流。正是野润烟光淡，
石翡山色翠。
LONG,
	])		: ([
		({16, 23})	: "5e;ne;2se",
		({24, 24})	: "2sw;2w;3nw",
		({30, 30})	: "4nw;sw;2w;nw",
		({24, 24})	: "2e",
		({26, 26})	: "3n;nw;3n;nw",
	]),

	([
		"short"		: "羊肠小道",
		"long"		: @LONG
一条蜿蜒曲折的小径，两边都是刀削般的峭壁。
路旁长满了一人多高的野草，据说常有妖怪精灵
出没。
LONG,
	])		: ([
		({11, 8})	: "4e;se;2s;n;2e;4se;3s;se;e",
	]),
	
	([
		"short"		: "山路",
		"long"		: @LONG
好不容易走出了小林，迈上了一条山间小路。越走树林越密，树缝
中洒下来的阳光也变得斑斑点点。茅草渐厚，灌木丛生。从东北方
吹来阵阵的冷风，令人毛骨耸然。
LONG,
	])		: ([
		({11, 8})	: "2ne;3e;2se;e;ne;3e;se;2s;sw;2s;se;4s",
		({19, 8})	: "se;e;2se",
	]),

	([
		"short"		: "背阴小道",
		"long"		: @LONG
这里是一条陡峭的小路，向上是背阴山，南边一座小桥，就是
令人胆颤的奈何桥。能听到桥下滚滚水声，也能听到鬼狼凄叫。
几个桥梁使者手握皮鞭，正驱敢着一些鬼怪。
LONG,
	])		: ([
		({16, 11})	: "s;3sw;3s;2se;e;s;n;2ne;4n;2nw",
		({16, 16})	: "nw;2n",
		({16, 16})	: "2ne",
		({16, 16})	: "s;2sw",
		({16, 16})	: "2s;se"
	]),
]);

mapping river = ([
	([
		"short"		: "白石溪",
		"long"		: @LONG
潺潺流水向山下流去，溪水清彻见底。水底布满了大小不一，洁
白如玉的鹅卵石，溪中的小鱼游来游去。溪边的草从中不时传出
蛙鸣。
LONG,
	])		: ([
		({0, 2})	: "se;2s;2se;2s;2se",
	]),

	([
		"short"		: "灌江",
		"long"		: @LONG
灌江水面不宽，江水缓缓向东流去。江面上偶尔出现几只打渔
的小船。一条土路顺江而铺，向东直通到灌江入长江的灌江口。
路上偶有几个行人，都是神色匆匆，忙着赶路。
LONG,
	])		: ([
		({5, 11})	: "12e",
	]),

	([
		"short"		: "子母河",
		"long"		: @LONG
一道小河，澄澄清水，湛湛寒波。远见河那边有柳阴垂碧，野
润烟光淡，沙暄日色曛。几处园林花放蕊，阳回大地柳芽新。
LONG,
	])		:  ([
		({17, 11})	: "2se;2s;se;5s",
	]),

	([
		"short"		: "流沙河",
		"long"		: @LONG
八百流沙界，三千弱水深。鹅毛飘不起，芦花定底沉。浪涌如
山，波翻若岭。
LONG,
	])		:  ([
		({10, 11})	: "6s;4se",
	]),

	([
		"short"		: "通天河",
		"long"		: @LONG
洋洋光浸月，浩浩影浮天。灵派吞华岳，长流贯百川。千层汹
浪滚，万迭峻波颠。岸口无渔火，沙头有鹭眠。茫然浑似海，
一望更无边。
LONG,
	])		:  ([
		({14, 21})	: "12e",
	]),

	([
		"short"		: "碧溪",
		"long"		: @LONG
只见香兰沿溪而生，芳草连天。溪水清绿流音潺潺。环绕着石
屋。也听见野禽声聒聒，也看见幽鹿步徐徐。真正是个仙家去
绝妙处，凡世哪里寻得到。
LONG,
	])		:  ([
		({32, 30})	: "nw;n;3nw;2n;2nw",
	]),
]);

void draw_all(object bg)
{
	//画出地图
	int n = draw(bg, ([
		"fort"		: fort,
		"river"		: river,
		"bridge"	: bridge,
		"road"		: road
	]));

	printf("create room: %d\n", n);
	
	//增加跳崖点
	set_move(at(10, 23), at(12, 21), "jump");
	set_move(at(20, 12), at(22, 10), "jump");
	
	//增加跳水/上岸点
	water_land(({1, 3}), ({2, 2}));
	water_land(({31, 29}), ({30, 30}));
	water_land(({10, 11}), ({10, 10}));
	water_land(({22, 21}), ({22, 22}));
	water_land(({19, 13}), ({18, 14}), ({20, 12}));
	water_land(({13, 20}), ({12, 21}), ({14, 19}));

	//设置入口
	set("entrance", ({0, at(2, 2), at(30, 30)}));
}

//获取据点坐标
mixed* forts()
{
	return values(fort);
}

void show(object who)
{
	 show_map(who, BG_WIDTH, BG_HEIGHT);
}