// firefox 11/21/2009

inherit NPC;

#include <ansi.h>
#include <xyj_x.h>

#define NAME					"谛听"
#define CD						30

int test_player();

object_f _task = TASK_GET("mieyao", "mieyao");

void create()
{
	set_name(NAME, ({ "di ting", "diting" }) );

	set("title", "万兽征物");
	set("gender", "雄性" );
	set("race", "野兽");
	set("can_speak", 1);
	set("age", 15);
	set("per", 120);
	set("long", "

谛听是地藏菩萨经案下伏的一神兽。他若伏在地下，一霎时，将四大部
洲山川社稷，洞天福地之间，蠃虫、麟虫、毛虫、羽虫、昆虫、天仙、
地仙、神仙、人仙、鬼仙可以照鉴善恶，察听贤愚。可明辨六耳猕猴与
孙悟空者，除了如来佛祖，就只有它了。

");	

	set("limbs", ({ "头部", "身体", "前脚", "后脚", "尾巴" }) );
	set("verbs", ({ "bite", "claw" }) );

	set("chat_chance", 1);
	set("chat_msg", ({
		NAME"用后腿抓了抓自己的耳朵。\n" }) 
	);
	set("inquiry", ([
		"mieyao":   (: test_player() :),
		"mieyao":   (: test_player() :),
	]));

	setup();
}


int test_player()
{
	object me = this_object();
	object who = this_player();
	object ob = _task->query_guai(who);

	if(!cd_start(me, "answer", CD)) {
		msvx(CYN"$N闭上眼睛假装睡着了...\n"NOR, me);
		return 1;
	}

	if(ob) {
		object env = environment(ob);
		if(env) {
			string map = MISC_D->find_place(env);
			string room = env->query("short");
			if(map != room) room = map + "的" + room;
			
			msvx(CYN"$N俯伏在地，须臾抬起头来，对$n说道：那妖怪正在%s。\n"NOR, me, who, room);
			return 1;
		}
	}

	msvx(CYN"$N俯伏在地，须臾抬起头来，对$n说道：世间无此怪。\n"NOR, me, who);
	return 1;
}

void die()
{
	set("eff_kee", 2200);
	set("eff_sen", 2200);
	set("kee", 2200);
	set("sen", 2200);
}

void unconcious()
{
	die ();
}



/*
相传为金地藏菩萨坐骑，又称“独角兽”，“地听”，“善听”，乃九华山镇山之宝。金地藏卓锡九华，立志修行，因有谛听昼夜相随，处处逢凶化吉，终成佛法。佛教尊称谛听为神犬，后人缘其晓佛理，通人性，避邪恶，视为吉祥的象征。 
谛听集群兽之瑞像于一身，聚众物之优容为一体，虎头、独角、犬耳、龙身、狮尾、麒麟足，形态别致，想象丰富。世人珍之为“镇宅之宝”、“庙堂之尊”、“天地精灵”和“万兽征物”，广泛纳为收藏。
谛听是佛门传言和民间演绎而存在下来的一个图腾和圣物。唐开元末年，古新罗（今韩国）王子24岁的金乔觉，看破红尘，携白犬一只浮海来华，削发为僧。白犬伴金乔觉一路颠簸，卓锡九华。在共同苦修的75载中，白犬与金乔觉昼夜相随，处处使其逢凶化吉。贞元十年（794）农历七月三十日金乔觉坐化，白犬亦随之傍息。
神犬谛听的出现，九华山下的柯、吴、刘、罗四大家族就以犬为宠物、爱物、宝物饲养，以求风调雨顺、五谷丰登、四季平安、人寿长乐。从造型看谛听，它的独角其一是象征着能接受宇宙之信息，似为“天线”之用；（其二能起到护身保险之用，它的犬耳是听宇宙之音频、传递给信者分辨是非，它的龙身示为吉祥如意，它的虎头表示智勇，有困难勇往直前，决不退让，它的狮尾表示有耐性、有雄心，办任何事坚持就是胜利，它的麒麟足视为四平八稳，与人为善、和睦相处、为善为宝。 
谛听貌似龙非龙、似虎非虎、似狮非狮、似麒麟非麒麟、似犬非犬，是人们想象中的征物，社会上又缘称“九不象”。民间广泛认为此物沾有“九气”，即“灵气、神气、福气、财气、锐气、运气、朝气、力气和骨气”。能起到“辟邪”、“消灾”、“降福”、“护身”等作用。一些虔诚的佛门信众更是相信沾上谛听的“灵气”即能使家运昌隆，基业常青；孩子带上它则屈壮成长，长大能成为诚者、贤者、智者、悟者、觉者、寿者。成年人带着它就心想事成、大吉大利的！ 
		

那兽奉地藏钧旨，就于森罗庭院之中，俯伏在地。须臾，抬起头来，
对地藏道：“怪名虽有，但不可当面说破，又不能 助力擒他。”地藏道：“当面说出便怎么？”
谛听道：“当面说出，恐妖精恶发，搔扰宝殿，致令阴府不安。”
又问：“何为不能助力擒拿？”谛听道：“妖精神通，与孙大圣无二。幽冥之神，能有多少法力，故此不能擒拿。”
地藏道：“似这般怎生祛除？”谛听言：“佛法无边。”
地藏早已省悟。即对行者道：“你两个形容如一，神通无二，若要辨明，须到雷音寺释迦如来那里，方得明白。”
两个一齐嚷道：“说的是，说的是！我和你西天佛祖之前折辨去！”那十殿阴君送
出，谢了地藏，回上翠云宫，着鬼使闭了幽冥关隘不题。
*/