// by firefox 03/27/2010

#include <armor.h>

inherit SURCOAT;

void create()
{
  set_name("锦镧袈裟", ({"jinlan jiasha", "jiasha"}) );
  set_weight(400);
  if( clonep() )
    set_default_object(__FILE__);
  else
  {
    set("long", "一件兽皮披风。\n");
    set("material", "leather");
    set("unit", "件");
    set("value", 700);
    set("armor_prop/armor", 35);
  }
  setup();
}


这袈裟：
龙披一缕，免大鹏蚕噬之灾；鹤挂一丝，得超凡入圣之妙。
但坐处，有万神朝礼；凡举动，有七佛随身。
这袈裟是冰蚕造练抽丝，巧匠翻腾为线。仙娥织就，神女机成。

方方簇幅绣花缝，片片相帮堆锦簆。
玲珑散碎斗妆花，色亮飘光喷宝艳。
穿上满身红雾绕，脱来一段彩云飞。
三天门外透玄光，五岳山前生宝气。
重重嵌就西番莲，灼灼悬珠星斗象。
四角上有夜明珠，攒顶间一颗祖母绿。
虽无全照原本体，也有生光八宝攒。

这袈裟，闲时折迭，遇圣才穿。
闲时折迭，千层包裹透虹霓；
遇圣才穿，惊动诸天神鬼怕。

上边有如意珠、摩尼珠、辟尘珠、定风珠；
又有那红玛瑙、紫珊瑚、夜明珠、舍利子。

偷月沁白，与日争红。
条条仙气盈空，朵朵祥光捧圣。
条条仙气盈空，照彻了天关；
朵朵祥光捧圣，影遍了世界。
照山川，惊虎豹；
影海岛，动鱼龙。


沿边两道销金锁，叩领连环白玉琮。诗曰：

三宝巍巍道可尊，四生六道尽评论。
明心解养人天法，见性能传智慧灯。
护体庄严金世界，身心清净玉壶冰。
自从佛制袈裟后，万劫谁能敢断僧？』

另：
朗朗明珠上下排，层层金线穿前后。
兜罗四面锦沿边，万样稀奇铺绮绣。
八宝妆花缚钮丝，金环束领攀绒扣。
佛天大小列高低，星象尊卑分左右。

