
// by firefox 10/01/2010
// 西游杀-装备

#include "xys.h"

mapping _armors = ([	//armor		spells		dodge
	
	//50
	({ "锦镧袈裟",		10,		40,		0,		"唐三藏的袈裟" })		: 2,
	({ "五彩天衣",		10,		30,		10,		"西王母的衣服" })		: 2,
	({ "金甲圣衣",		40,		20,		-10,		"孙悟空的甲胄" })		: 2,
	({ "龙鳞细甲",		65,		-10,		-5,		"秦叔宝的甲胄" })		: 2,

	//30
	({ "金缕法衣",		20,		10,		0,		"如意真仙的法衣" })	: 20,
	({ "蛛丝软甲",		15,		15,		0,		"蜘蛛精的内甲" })		: 20,
	({ "虹霓甲",			25,		10,		-5,		"灵感大王的盔甲" })	: 20,
	({ "亮银甲",			45,		-5,		-10,		0 })				: 20,

	//20
	({ "乌铁甲",			35,		-5,		-10,		0 })				: 30,
	({ "青铜甲",			35,		-5,		-10,		0 })				: 30,
	({ "藤甲",			30,		-5,		0,		0 })				: 30,
	({ "宫袍",			20,		0,		10,		0 })				: 30,
	
]);


mapping aaa()
{
	mixed* m = roulette(_armors);

	mapping card = ([
		"type"			: "披挂",
		"name"			: m[0],
		"comment"		: m[4],
		"slot"			: C_CLOTH,
		EQU_PROP		: ([ "armor" : m[1], "spells" : m[2]*2, "dodage" : m[3]*2 ]),
	]);
	return card;
}

