
法宝——如意棒

1.棒
2.祭出乱棒击打敌人
3.画地为牢，可保护某人	Draw a circle


如意金箍棒

随心铁杆兵

天河镇底神珍铁


$N取$w幌了一幌，在地上围绕%s周围画了一道圈子。
$N正欲对$n痛下杀手，突然感觉到有一道看不见的铜墙铁壁，无法近身。
你在铜墙铁壁之中，无法施展。（不能攻击，也不能被攻击，石像鬼形态？拖CD）


$N把$w丢起，叫一声『变！』就以一变十，以十变百，以百变千！
漫天乱棒，好似蛇游蟒搅，噼噼啪啪的打下来。

千百$n收做一根，飞回$N手中。

一万三千五百斤重


猴王不惧呵呵笑，铁棒翻腾自运筹。以一化千千化万，满空乱舞赛飞虬。


行者把棒丢起，叫一声『变！』就以一变十，以十变百，
以百变千，半天里，好似蛇游蟒搅，乱打妖邪。

行者念声咒语，将铁棒收做一根，



棒是九转镔铁炼，老君亲手炉中煅。
禹王求得号神珍，四海八河为定验。
中间星斗暗铺陈，两头箝裹黄金片。
花纹密布鬼神惊，上造龙纹与凤篆。
名号灵阳棒一条，深藏海藏人难见。
成形变化要飞腾，飘爨五色霞光现。
老孙得道取归山，无穷变化多经验。
时间要大瓮来粗，或小些微如铁线。
粗如南岳细如针，长短随吾心意变。
轻轻举动彩云生，亮亮飞腾如闪电。
攸攸冷气逼人寒，条条杀雾空中现。
降龙伏虎谨随身，天涯海角都游遍。
曾将此棍闹天宫，威风打散蟠桃宴。
天王赌斗未曾赢，哪吒对敌难交战。
棍打诸神没躲藏，天兵十万都逃窜。
雷霆众将护灵霄，飞身打上通明殿。
掌朝天使尽皆惊，护驾仙卿俱搅乱。
举棒掀翻北斗宫，回首振开南极院。
金阙天皇见棍凶，特请如来与我见。
兵家胜负自如然，困苦灾危无可辨。
整整挨排五百年，亏了南海菩萨劝。
大唐有个出家僧，对天发下洪誓愿。
枉死城中度鬼魂，灵山会上求经卷。
西方一路有妖魔，行动甚是不方便。
已知铁棒世无双，央我途中为侣伴。
邪魔汤着赴幽冥，肉化红尘骨化面。
处处妖精棒下亡，论万成千无打算。
上方击坏斗牛宫，下方压损森罗殿。
天将曾将九曜追，地府打伤催命判。
半空丢下振山川，胜如太岁新华剑。
全凭此棍保唐僧，天下妖魔都打遍！